
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Остатки_товаров Приход
	Движения.Остатки_товаров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Остатки_товаров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Движения.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Остатки_товаровОстатки.Товар КАК Товар,
		|	Остатки_товаровОстатки.Склад КАК Склад,
		|	Остатки_товаровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Остатки_товаров.Остатки КАК Остатки_товаровОстатки
		|ГДЕ
		|	Остатки_товаровОстатки.КоличествоОстаток < 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Мало товара " + ВыборкаДетальныеЗаписи.Товар + " нужно ещё " +
			( - ВыборкаДетальныеЗаписи.КоличествоОстаток))
		
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры
